test_runs/load/async/many/artillery_output.txt
Phase started: WarmUp (index: 0, duration: 30s) 17:29:01(-0300)

--------------------------------------
Metrics for period to: 17:29:10(-0300) (width: 7.066s)
--------------------------------------

http.codes.200: ................................................................ 35
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 40
http.response_time:
  min: ......................................................................... 1056
  max: ......................................................................... 1548
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1525.7
  p99: ......................................................................... 1556.5
http.responses: ................................................................ 35
vusers.completed: .............................................................. 35
vusers.created: ................................................................ 40
vusers.created_by_name.async: .................................................. 40
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1059.9
  max: ......................................................................... 1572.2
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1556.5
  p99: ......................................................................... 1556.5


--------------------------------------
Metrics for period to: 17:29:20(-0300) (width: 9.066s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 1055
  max: ......................................................................... 1064
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.async: .................................................. 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1058.7
  max: ......................................................................... 1069.1
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4


Phase completed: WarmUp (index: 0, duration: 30s) 17:29:31(-0300)

Phase started: RampUp (index: 1, duration: 30s) 17:29:31(-0300)

--------------------------------------
Metrics for period to: 17:29:30(-0300) (width: 9.066s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 1055
  max: ......................................................................... 1063
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.async: .................................................. 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1057.3
  max: ......................................................................... 1067.5
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4


--------------------------------------
Metrics for period to: 17:29:40(-0300) (width: 9.07s)
--------------------------------------

http.codes.200: ................................................................ 72
http.request_rate: ............................................................. 9/sec
http.requests: ................................................................. 74
http.response_time:
  min: ......................................................................... 1054
  max: ......................................................................... 1061
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4
http.responses: ................................................................ 72
vusers.completed: .............................................................. 72
vusers.created: ................................................................ 74
vusers.created_by_name.async: .................................................. 74
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1056.3
  max: ......................................................................... 1084.5
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1085.9


--------------------------------------
Metrics for period to: 17:29:50(-0300) (width: 9.859s)
--------------------------------------

http.codes.200: ................................................................ 155
http.request_rate: ............................................................. 17/sec
http.requests: ................................................................. 166
http.response_time:
  min: ......................................................................... 1053
  max: ......................................................................... 1089
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4
http.responses: ................................................................ 155
vusers.completed: .............................................................. 155
vusers.created: ................................................................ 166
vusers.created_by_name.async: .................................................. 166
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1055.1
  max: ......................................................................... 1092.7
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1085.9


Phase completed: RampUp (index: 1, duration: 30s) 17:30:02(-0300)

Phase started: Plain (index: 2, duration: 120s) 17:30:02(-0300)

--------------------------------------
Metrics for period to: 17:30:00(-0300) (width: 9.861s)
--------------------------------------

http.codes.200: ................................................................ 244
http.request_rate: ............................................................. 25/sec
http.requests: ................................................................. 256
http.response_time:
  min: ......................................................................... 1051
  max: ......................................................................... 1081
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4
http.responses: ................................................................ 244
vusers.completed: .............................................................. 244
vusers.created: ................................................................ 256
vusers.created_by_name.async: .................................................. 256
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1055
  max: ......................................................................... 1085.7
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4


--------------------------------------
Metrics for period to: 17:30:10(-0300) (width: 9.866s)
--------------------------------------

http.codes.200: ................................................................ 293
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 293
http.response_time:
  min: ......................................................................... 1051
  max: ......................................................................... 1063
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4
http.responses: ................................................................ 293
vusers.completed: .............................................................. 293
vusers.created: ................................................................ 293
vusers.created_by_name.async: .................................................. 293
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1054.9
  max: ......................................................................... 1069.5
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4


--------------------------------------
Metrics for period to: 17:30:20(-0300) (width: 9.862s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1051
  max: ......................................................................... 1063
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.async: .................................................. 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1054.6
  max: ......................................................................... 1067.7
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4


--------------------------------------
Metrics for period to: 17:30:30(-0300) (width: 9.86s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1051
  max: ......................................................................... 1066
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.async: .................................................. 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1054
  max: ......................................................................... 1072.2
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4


--------------------------------------
Metrics for period to: 17:30:40(-0300) (width: 9.863s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1052
  max: ......................................................................... 1063
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.async: .................................................. 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1053.9
  max: ......................................................................... 1075.2
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4


--------------------------------------
Metrics for period to: 17:30:50(-0300) (width: 9.86s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1050
  max: ......................................................................... 1065
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.async: .................................................. 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1054.2
  max: ......................................................................... 1079.9
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4


--------------------------------------
Metrics for period to: 17:31:00(-0300) (width: 9.859s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1050
  max: ......................................................................... 1069
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.async: .................................................. 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1054.2
  max: ......................................................................... 1073.9
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4


--------------------------------------
Metrics for period to: 17:31:10(-0300) (width: 9.858s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1051
  max: ......................................................................... 1085
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1085.9
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.async: .................................................. 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1054.1
  max: ......................................................................... 1087.2
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1085.9


--------------------------------------
Metrics for period to: 17:31:20(-0300) (width: 9.858s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1051
  max: ......................................................................... 1118
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1085.9
  p99: ......................................................................... 1085.9
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.async: .................................................. 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1053.9
  max: ......................................................................... 1121.8
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1085.9
  p99: ......................................................................... 1085.9


--------------------------------------
Metrics for period to: 17:31:30(-0300) (width: 9.878s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1049
  max: ......................................................................... 1103
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1085.9
  p99: ......................................................................... 1085.9
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.async: .................................................. 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1054.1
  max: ......................................................................... 1106.8
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1085.9
  p99: ......................................................................... 1107.9


--------------------------------------
Metrics for period to: 17:31:40(-0300) (width: 9.861s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1052
  max: ......................................................................... 1085
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1085.9
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.async: .................................................. 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1054.1
  max: ......................................................................... 1090.5
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1085.9
  p99: ......................................................................... 1085.9


--------------------------------------
Metrics for period to: 17:31:50(-0300) (width: 9.86s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1051
  max: ......................................................................... 1069
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.async: .................................................. 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1053.9
  max: ......................................................................... 1069.8
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4


Phase completed: Plain (index: 2, duration: 120s) 17:32:02(-0300)

Phase started: Cleanup (index: 3, duration: 15s) 17:32:02(-0300)

--------------------------------------
Metrics for period to: 17:32:00(-0300) (width: 9.863s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1052
  max: ......................................................................... 1082
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.async: .................................................. 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1054
  max: ......................................................................... 1083.4
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1085.9


Phase completed: Cleanup (index: 3, duration: 15s) 17:32:17(-0300)

--------------------------------------
Metrics for period to: 17:32:10(-0300) (width: 3.892s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 90
http.response_time:
  min: ......................................................................... 1043
  max: ......................................................................... 1085
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1085.9
  p99: ......................................................................... 1085.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 90
vusers.created_by_name.async: .................................................. 90
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1054
  max: ......................................................................... 1093.3
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1085.9
  p99: ......................................................................... 1085.9


All VUs finished. Total time: 3 minutes, 18 seconds

--------------------------------
Summary report @ 17:32:18(-0300)
--------------------------------

http.codes.200: ................................................................ 4319
http.request_rate: ............................................................. 25/sec
http.requests: ................................................................. 4319
http.response_time:
  min: ......................................................................... 1043
  max: ......................................................................... 1548
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1085.9
http.responses: ................................................................ 4319
vusers.completed: .............................................................. 4319
vusers.created: ................................................................ 4319
vusers.created_by_name.async: .................................................. 4319
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1053.9
  max: ......................................................................... 1572.2
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1085.9